'''
Цикл
Ввести с клавиатуры строку.
Вывести эту же строку вертикально: по одному символу на строку консоли.
'''

string = input('Введите строку: ')

for i in string:
    print(i)