'''
Цикл
Создать список из десяти целых чисел.
Вывести на экран каждое число, увеличенное на 1.
'''


int_numbers = [2,4,5,6,3,6,6,7,8,1]


for i in int_numbers:
    print(i+1)
    